import React from 'react';
import StoryHeaderBanner from '../Components/storyHeaderBanner.jsx';
import Navbar from '../Components/navbar.jsx'
import '../CSS/storypage.css';
const Story = () => {
    return (
        <div>
            <Navbar/>
            <StoryHeaderBanner
                title="غزوة بدر"
                showPlayButton={true}
                onPlayClick={() => console.log("Play clicked")}
                showToggleButton={true}
            />

            <h3 className='the-story'>فِي شَهْرِ صَفَرٍ مِنَ السَّنَةِ الثَّانِيَةِ لِلْهِجْرَةِ، خَرَجَ رَسُولُ اللهِ ﷺ بِنَفْسِهِ فِي أُوْلَى غَزَوَاتِهِ، وَكَانَ مَعَهُ سَبْعُونَ رَجُلًا مِنَ الْمُهَاجِرِينَ. وَقَدِ اسْتَخْلَفَ النَّبِيُّ ﷺ عَلَى الْمَدِينَةِ سَعْدَ بْنَ عُبَادَةَ رضي الله عنه، ثُمَّ تَوَجَّهَ النَّبِيُّ ﷺ بِالْجَيْشِ لِيَعْتَرِضَ قَافِلَةً لِقُرَيْشٍ كَانَتْ تَمُرُّ بِتِلْكَ الْمَنَاطِقِ. وَصَلَ الجَيْشُ إِلَى مَنْطِقَةِ وُدَّان (وَتُسَمَّى أَيْضًا الأَبْواء)، وَلَكِنَّهُمْ لَمْ يَلْقَوْا قَافِلَةً وَلَا حَدَثَ قِتَالٌ. وَفِي هَذِهِ الْغَزْوَةِ، عَقَدَ رَسُولُ اللهِ ﷺ مُعَاهَدَةَ أَمْنٍ وَسِلْمٍ مَعَ بَنِي ضَمْرَةَ، وَكَانَ سَيِّدُهُمْ يُدْعَى عَمْرُو بْنُ مَخْشِيٍّ الضَّمْرِيِّ. وَقَدْ نَصَّتِ الْمُعَاهَدَةُ عَلَى: أَنْ يَكُونَ بَيْنَ الْمُسْلِمِينَ وَبَنِي ضَمْرَةَ أَمْنٌ وَسِلْمٌ. وَأَنْ لَا يُنَاصِرُوا أَعْدَاءَ النَّبِيِّ ﷺ. وَإِذَا احْتَاجَ النَّبِيُّ ﷺ إِلَى نُصْرَتِهِمْ، فَإِنَّهُمْ يَنْصُرُونَهُ. وَكَانَ لِوَاءُ الغَزْوَةِ أَبْيَضَ، وَقَدْ حَمَلَهُ حَمْزَةُ بْنُ عَبْدِ الْمُطَّلِبِ رضي الله عنه. وَدَامَتِ الغَزْوَةُ خَمْسَةَ عَشَرَ يَوْمًا، ثُمَّ رَجَعَ رَسُولُ اللهِ ﷺ وَمَنْ مَعَهُ إِلَى الْمَدِينَةِ.</h3>
        </div>
    );
}

export default Story;